export default {
  "tab.title": "ރިވިއު",
  "mobile.title": "ބަދަލުތައް",
  "tab.count.one": "⁨{{count}}⁩ ފައިލް ބަދަލުވެއްޖެއެވެ",
  "tab.count.other": "⁨{{count}}⁩ ފައިލްތައް ބަދަލުވެއްޖެއެވެ",
  "empty.git": "އަދި ކޮމިޓް ނުކުރާ ބަދަލެއް ނާދެއެވެ",
  "empty.branch": "އަދި އެއްވެސް ބްރާންޗަކަށް ބަދަލެއް ނާދެއެވެ",
  "git.title": "Git ރިޕޮޒިޓަރީއެއް އުފެއްދުން",
  "git.description": "މި މަޝްރޫޢަށް އަންނަ ބަދަލުތައް ޓްރެކްކޮށް، ރިވިއުކޮށް، އަންޑޯކުރުން",
  loadingChanges: "ބަދަލުތައް ލޯޑް ކުރަނީ…",
  noChanges: "އެއްވެސް ބަދަލެއް ނާދެއެވެ",
  "settings.wrapLines.title": "ރޮނގުތައް ވެށުވުން",
  "settings.wrapLines.description":
    "މޯބައިލް ޑިފްތަކުގައި އަރުދުކޮށް ސްކްރޯލްކުރުމުގެ ބަދަލުގައި ދިގު ރޮނގުތައް ވެށުވާ",
}
