export default {
  "tab.title": "ރިވިއު",
  "tab.count.one": "⁨{{count}}⁩ ފައިލް ބަދަލުވެއްޖެއެވެ",
  "tab.count.other": "⁨{{count}}⁩ ފައިލްތައް ބަދަލުވެއްޖެއެވެ",
  "mobile.title.one": "ބަދަލު",
  "mobile.title.other": "ބަދަލުތައް",
  "empty.git": "އަދި ކޮމިޓް ނުކުރާ ބަދަލެއް ނާދެއެވެ",
  "empty.branch": "އަދި އެއްވެސް ބްރާންޗަކަށް ބަދަލެއް ނާދެއެވެ",
  "git.title": "Git ރިޕޮޒިޓަރީއެއް އުފެއްދުން",
  "git.description": "މި މަޝްރޫޢަށް އަންނަ ބަދަލުތައް ޓްރެކްކޮށް، ރިވިއުކޮށް، އަންޑޯކުރުން",
  loadingChanges: "ބަދަލުތައް ލޯޑް ކުރަނީ…",
  noChanges: "އެއްވެސް ބަދަލެއް ނާދެއެވެ",
}
