export default {
  "mobile.title": "བསྒྱུར་བཅོས་ཚུ།",
  "tab.title": "བསྐྱར་ཞིབ",
  "tab.count.one": "{{count}} ཡིག་སྣོད་བསྒྱུར་བཅོས་འབད་ཡོདཔ།",
  "tab.count.other": "{{count}} ཡིག་སྣོད་ཚུ་བསྒྱུར་བཅོས་འབད་ཡོདཔ།",
  "empty.git": "ཁས་ལེན་མ་འབད་བའི་བསྒྱུར་བཅོས་ཚུ་ད་ལྟོ་མེད།",
  "empty.branch": "ཡན་ལག་བསྒྱུར་བཅོས་ད་ལྟོ་མེད།",
  "git.title": "Gitམཛོད་ཅིག་གསར་བསྐྲུན་འབད།",
  "git.description": "ལས་འགུལ་འདི་ནང་ བསྒྱུར་བཅོས་ཚུ་ བརྟག་ཞིབ་འབད་ནི་དང་ བསྐྱར་ཞིབ་འབད་ནི་ དེ་ལས་ འབད་བཤོལ་འབད་ནི།",
  loadingChanges: "བསྒྱུར་བཅོས་ཚུ་མངོན་གསལ་འབད་དོ…",
  noChanges: "བསྒྱུར་བཅོས་མེད།",
  "settings.wrapLines.title": "གྲལ་ཐིག་ཚུ་བསྡམས།",
  "settings.wrapLines.description":
    "འཕྲེད་ལ་བཤུད་སྒྲིལ་འབད་ནིའི་ཚབ་ལུ་ འགྲུལ་འཕྲིན་ཁྱད་པར་ཚུ་ནང་གྲལ་ཐིག་རིངམོ་ཚུ་བསྡམས།",
}
