export default {
  "command.toggle": "ޑީބަގް ބާ ޓޮގަލް ކުރަން",
  providerAriaLabel: "ޕްރޮވައިޑަރ ޕަފޯމަންސް ޑައިއަގްނޮސްޓިކްސް",
  na: "n/a",
  "duration.label": "TIME",
  "duration.tip": "އެންމެ ފަހުގެ ޓާރން ފެށި ޕްރޮމްޕްޓުން ފެށިގެން ޖަވާބު ނިމެންދެން ދާ ވަގުތު.",
  "tps.label": "TPS",
  "tps.tip":
    "އެންމެ ފަހުގެ ޓާރންގެ މޮޑެލް ރިކުއެސްޓްތަކުގައި ސިކުންތަކަށް އައުޓްޕުޓް އަދި ރީޒަނިންގ ޓޯކަންތައް، ޓޫލްގެ ވަގުތު ނުހިމަނައި.",
  "focus.label": "FOCUS އެވެ",
  "focus.tip": "ފޯސް ފޯކަސް ސްޓައިލްސް ހުރިހާ އިންޓަރެކްޓިވް އެލިމެންޓްތަކަށް",
  "focus.on": "ON އެވެ",
  "focus.off": "OFF އެވެ",
  "direction.label": "ޑރ",
  "direction.tip": "ހޮވާފައިވާ ބަހަށް ބަދަލެއް ނުގެނެސް ފުލް އެޕް ލޭއައުޓް ޑިރެކްޝަން ފޯސް ކުރާށެވެ",
  "direction.ltr": "LTR އެވެ",
  "direction.rtl": "RTL އެވެ",
}
