export default {
  "command.toggle": "རྐྱེན་སེལ་ཕྲ་རིང་སྟོན་ནི་ཡང་ན་སྦ་ནི།",
  providerAriaLabel: "བྱིན་མིའི་ལཱ་ཤུགས་བརྟག་དཔྱད།",
  na: "ན/ཨེ།",
  "duration.label": "TIME",
  "duration.tip": "མཐའ་མཇུག་གི་རིམ་པ་འགོ་བཙུགས་མི་ཞུ་བ་ལས་ ལན་མཇུག་བསྡུ་ཚུན་གྱི་དུས་ཚོད།",
  "tps.label": "TPS",
  "tps.tip":
    "མཐའ་མཇུག་གི་རིམ་པའི་དཔེ་ཚད་ཞུ་བ་ཚུ་ནང་ སྐར་ཆ་རེར་ཐོན་འབྲས་དང་བསམ་གཞིགས་ཊོ་ཀེན་ ལག་ཆའི་དུས་ཚོད་མ་བརྩིས་པར།",
  "focus.label": "FOCUS",
  "focus.tip": "ཕན་ཚུན་འབྲེལ་བའི་ཆ་ཤས་ཚུ་ཆ་མཉམ་ལུ་ ཆེད་དམིགས་བཟོ་རྣམ་ཚུ་ བཙན་ཤུགས་འབད།",
  "focus.on": "ཐོག༌ཁར",
  "focus.off": "ཡལ་བ",
  "direction.label": "DIR།",
  "direction.tip": "སེལ་འཐུ་འབད་ཡོད་པའི་སྐད་ཡིག་བསྒྱུར་བཅོས་མ་འབད་བར་ གློག་རིམ་ཆ་ཚང་སྒྲིག་བཀོད་ཁ་ཕྱོགས་བང་བཙོང་འབད།",
  "direction.ltr": "LTR།",
  "direction.rtl": "RTL།",
}
