export default {
  "command.toggle": "Дибагийн мөрийг сэлгэх",
  providerAriaLabel: "Үйлчилгээ үзүүлэгчийн гүйцэтгэлийн оношилгоо",
  na: "үгүй",
  "duration.label": "TIME",
  "duration.tip": "Сүүлийн ээлжийг эхлүүлсэн хүсэлтээс хариулт дуусах хүртэлх хугацаа.",
  "tps.label": "TPS",
  "tps.tip":
    "Сүүлийн ээлжийн загварын хүсэлтүүд дэх секунд тутмын гаралтын болон сэтгэлгээний токен, хэрэгслийн хугацааг оруулахгүй.",
  "focus.label": "FOCUS",
  "focus.tip": "Бүх интерактив элементүүд дээр анхаарлаа төвлөрүүлэх хэв маягийг хүчлэх",
  "focus.on": "АСААЛТТАЙ",
  "focus.off": "OFF",
  "direction.label": "DIR",
  "direction.tip": "Сонгосон хэлийг өөрчлөхгүйгээр програмын бүдүүвчийг бүхэлд нь чиглүүлэх",
  "direction.ltr": "LTR",
  "direction.rtl": "RTL",
}
